cf/Reports/РолиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>РолиПользователей</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПользовательИБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРоли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольУстановлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходРазрешен</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЗРолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРоли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРоли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РедактированиеЦеныВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольВремениПосещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЧужихРазмещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьНовыйПарольПриВходе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРозничныйМагазин</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>idДиалогаТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КтоМожетПросматриватьСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрофилиИнтернетПочты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Reports/РолиПользователей/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	УстановитьПривилегированныйРежим(Истина);

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();

	ЗаполнитьТЗ();
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТЗ",ТЗ);
	ВнешниеНаборыДанных.Вставить("ТЗРоли",ТЗРолей);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки,ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.НачатьВывод();

	ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	Пока ЭлементРезультата <> Неопределено Цикл
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
КонецПроцедуры

Процедура ЗаполнитьТЗ()
	ТЗ.Очистить();
	ТЗРолей.Очистить();
	
	МассивПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
//	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
//	ЗначениеПараметра = Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокРеквизитов"));
//	//ЗначениеПараметраПериод = Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
//	Если НЕ ЗначениеПараметра.Использование ИЛИ НЕ ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
//		ЗначениеПараметра.Использование = Истина;
//   		Параметры.УстановитьЗначениеПараметра("СписокРеквизитов", МассивРеквизитов);
//	КонецЕсли;
	
	Роли = Новый Массив;
	ЗначениеПараметраРоли = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0];
	Если ЗначениеПараметраРоли.Использование = Истина И ЗначениеЗаполнено(ЗначениеПараметраРоли.Значение) Тогда
		Если ТипЗнч(ЗначениеПараметраРоли.Значение) = Тип("Строка") Тогда
			Роли.Добавить(НРег(ЗначениеПараметраРоли.Значение));
		Иначе
			Для Каждого ТекРоль Из ЗначениеПараметраРоли.Значение Цикл
				Роли.Добавить(НРег(ТекРоль.Значение));
			КонецЦикла;
			//Роли = ЗначениеПараметраРоли.Значение.ВыгрузитьЗначения();
		КонецЕсли;
	КонецЕсли;
	
	Пользователи = Новый Массив;
	ЗначениеПараметраПользователи = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1];
	Если ЗначениеПараметраПользователи.Использование = Истина И ЗначениеЗаполнено(ЗначениеПараметраПользователи.Значение) Тогда
		Если ТипЗнч(ЗначениеПараметраПользователи.Значение) = Тип("СправочникСсылка.Пользователи") Тогда
			Пользователи.Добавить(ЗначениеПараметраПользователи.Значение);
		Иначе
			Для Каждого ТекПользователь Из ЗначениеПараметраПользователи.Значение Цикл
				Пользователи.Добавить(ТекПользователь.Значение);
			КонецЦикла;
			//Роли = ЗначениеПараметраПользователи.Значение.ВыгрузитьЗначения();
		КонецЕсли;
	КонецЕсли;
	
	Для каждого ПользовательИБ Из МассивПользователей Цикл
		Для Каждого РольПользователя ИЗ ПользовательИБ.Роли Цикл
			Если Роли.Количество()>0 И Роли.Найти(НРег(РольПользователя.Имя))=Неопределено И Роли.Найти(НРег(РольПользователя.Синоним))=Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Пользователи.Количество()>0 Тогда
				Если Пользователи.Найти(Справочники.Пользователи.НайтиПоРеквизиту("ПользовательИБ",ПользовательИБ.УникальныйИдентификатор))=Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаРоли = ТЗ.Добавить();
			СтрокаРоли.ИмяРоли = РольПользователя.Имя;			
			СтрокаРоли.Пометка = Истина;     	
			СтрокаРоли.ПользовательИБ = ПользовательИБ.Имя;
			СтрокаРоли.Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ПользовательИБ",ПользовательИБ.УникальныйИдентификатор);
			СтрокаРоли.ВходРазрешен = ?(ПользовательИБ.АутентификацияСтандартная Или ПользовательИБ.АутентификацияОС Или ПользовательИБ.АутентификацияOpenID,"+","");

			СтрокаРоли.ПарольУстановлен = ПользовательИБ.ПарольУстановлен;
			СтрокаРоли.ПолноеИмя = ПользовательИБ.ПолноеИмя;
			
		КонецЦикла; 
	КонецЦикла;
	
	Для каждого Роль Из Метаданные.Роли Цикл
		Если Роли.Количество()>0 И Роли.Найти(НРег(Роль.Имя))=Неопределено И Роли.Найти(НРег(Роль.Синоним))=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРоли = ТЗРолей.Добавить();
		СтрокаРоли.ИмяРоли = Роль.Имя;
		СтрокаРоли.ПредставлениеРоли = Роль.Синоним;
	КонецЦикла;
КонецПроцедуры
